[
  {
    "id": "qMyFYCIbXIo",
    "title": "Fighting Shadows | Song of Redemption and Resilience",
    "type": "song",
    "featured": true,
    "description": "A worship anthem born out of real pain, real struggle, and real grace. Written for anyone who's ever felt like they were losing the fight—to addiction, shame, fear, or regret. Dedicated to the men and women of Recovery Soldiers Ministry.",
    "blogPost": "/blog/fighting-shadows"
  },
  {
    "id": "X7Ls7NPeQXs",
    "title": "Outstretched Hands | Worship Ballad of Redemption and Mercy | Tribute to Recovery Soldiers Ministry",
    "type": "song",
    "featured": false,
    "description": "The companion to Fighting Shadows—sung from the first-person perspective of Christ. A gentle, unflinching reminder that no matter how far we fall, His hands remain outstretched—not to shame, but to save.",
    "blogPost": "/blog/outstretched-hands"
  },
  {
    "id": "A-Xza8SbaIA",
    "title": "Town Called Nowhere | Gritty Acoustic Alt-Country Song About Redemption",
    "type": "song",
    "featured": false,
    "description": "“Town Called Nowhere” is a gritty, acoustic-driven alt-country song about wandering, pride, and the quiet moment when grace finally breaks through.\nBuilt on fingerpicked guitar, warm organic tones, and sparse instrumentation, the song unfolds slowly—leaving space for reflection, regret, and ultimately redemption. The verses sit in a minor-key tension before lifting into a restrained but hopeful resolution, echoing the journey from self-will to surrender.\n\nThis song is for anyone who’s walked every road looking for peace… only to realize the way out begins with humility.\n\nLyrics themes include:\n• Losing your way and naming it “fate”\n• The weight of pride and silence\n• Mercy that meets you where you are\n• Faith rebuilt, not forced\n\nIf you connect with artists like Tyler Childers, Jason Isbell, or stripped-down Americana worship storytelling, this one’s for you.\n\n🎧 Best experienced with headphones\n📍 Recorded with an emphasis on intimacy and natural decay",
    "blogPost": "/blog/town-called-nowhere-gritty-acoustic-alt-country-song-about-redemption"
  }
]
